In [29]:
import pandas as pd
csv_test = pd.read_csv('data/GU_2019.csv', encoding="CP949",index_col = False)

C:\Users\82104\AppData\Local\Temp/ipykernel_12616/327394670.py:2: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  csv_test = pd.read_csv('data/GU_2019.csv', encoding="CP949",index_col = False)

In [30]:
csv_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211200 entries, 0 to 211199
Data columns (total 32 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   기준일ID            211200 non-null  int64
 1   시간대구분            211200 non-null  int64
 2   자치구코드            211200 non-null  int64
 3   총생활인구수           211200 non-null  float64
 4   남자0세부터9세생활인구수    211200 non-null  float64
 5   남자10세부터14세생활인구수  211200 non-null  float64
 6   남자15세부터19세생활인구수  211200 non-null  float64
 7   남자20세부터24세생활인구수  211200 non-null  float64
 8   남자25세부터29세생활인구수  211200 non-null  float64
 9   남자30세부터34세생활인구수  211200 non-null  float64
 10  남자35세부터39세생활인구수  211200 non-null  float64
 11  남자40세부터44세생활인구수  211200 non-null  float64
 12  남자45세부터49세생활인구수  211200 non-null  float64
 13  남자50세부터54세생활인구수  211200 non-null  float64
 14  남자55세부터59세생활인구수  211200 non-null  float64
 15  남자60세부터64세생활인구수  211200 non-null  float64
 16  남자65세부터69세생활인구수  211200 non-null  float64
 17  남자70세이상생활인구수     211200 non-null  float64
 18  여자0세부터9세생활인구수    211200 non-null  float64
 19  여자10세부터14세생활인구수  211200 non-null  float64
 20  여자15세부터19세생활인구수  211200 non-null  float64
 21  여자20세부터24세생활인구수  211200 non-null  float64
 22  여자25세부터29세생활인구수  211200 non-null  float64
 23  여자30세부터34세생활인구수  211200 non-null  float64
 24  여자35세부터39세생활인구수  211200 non-null  float64
 25  여자40세부터44세생활인구수  211200 non-null  float64
 26  여자45세부터49세생활인구수  211200 non-null  float64
 27  여자50세부터54세생활인구수  211200 non-null  float64
 28  여자55세부터59세생활인구수  211200 non-null  float64
 29  여자60세부터64세생활인구수  211200 non-null  float64
 30  여자65세부터69세생활인구수  211200 non-null  float64
 31  여자70세이상생활인구수     211200 non-null  float64
dtypes: float64(29), int64(3)
memory usage: 51.6 MB

In [31]:
csv_test= csv_test[['기준일ID','시간대구분','자치구코드','총생활인구수']]

In [32]:
csv_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211200 entries, 0 to 211199
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   기준일ID   211200 non-null  int64
 1   시간대구분   211200 non-null  int64
 2   자치구코드   211200 non-null  int64
 3   총생활인구수  211200 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 6.4 MB

In [33]:
csv_test

           기준일ID  시간대구분  자치구코드       총생활인구수
0       20190101      0  11110  247783.9476
1       20190101      0  11140  176516.2769
2       20190101      0  11170  287806.8492
3       20190101      0  11200  335106.5204
4       20190101      0  11215  399818.0269
...          ...    ...    ...          ...
211195  20191231     23  11620  512045.7410
211196  20191231     23  11650  507017.9562
211197  20191231     23  11680  701730.1925
211198  20191231     23  11710  776809.6518
211199  20191231     23  11740  522271.9542

[211200 rows x 4 columns]

In [35]:
csv_test = csv_test[csv_test['시간대구분']==0]

In [37]:
csv_test= csv_test[['기준일ID','자치구코드','총생활인구수']]

In [45]:
csv_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8800 entries, 0 to 210624
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   기준일ID   8800 non-null   string
 1   자치구코드   8800 non-null   int64
 2   총생활인구수  8800 non-null   float64
dtypes: float64(1), int64(1), string(1)
memory usage: 275.0 KB

In [50]:
csv_test = csv_test.astype({'기준일ID':'string'})
csv_test = csv_test.astype({'총생활인구수':'int'})

In [51]:
csv_test["Year"] = csv_test['기준일ID'].str[:4]
csv_test["Month"] = csv_test['기준일ID'].str[4:6]

In [54]:
csv_test = csv_test[['Year','Month','자치구코드','총생활인구수']]

In [55]:
csv_test

        Year Month  자치구코드  총생활인구수
0       2019    01  11110  247783
1       2019    01  11140  176516
2       2019    01  11170  287806
3       2019    01  11200  335106
4       2019    01  11215  399818
...      ...   ...    ...     ...
210620  2019    12  11620  534943
210621  2019    12  11650  498231
210622  2019    12  11680  693225
210623  2019    12  11710  767562
210624  2019    12  11740  522989

[8800 rows x 4 columns]

In [61]:
grouped =csv_test.groupby(["Year","Month","자치구코드"])
grouped

In [65]:
tp = grouped.agg('총생활인구수')
print(tp.first())

Year  Month  자치구코드
2019  01     11110    247783
             11140    176516
             11170    287806
             11200    335106
             11215    399818
                       ...
      12     11620    534349
             11650    495785
             11680    664892
             11710    751170
             11740    517560
Name: 총생활인구수, Length: 300, dtype: int32

In [68]:

datas = [elem for elem in tp.first()]
np.mean(datas.mean)

NameError: name 'np' is not defined